app/Controllers/Post.php

INSERT INTO `artikel` (`judul`, `isi`) VALUES ('hehe', 'adakah')
---
    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi'  => $this->request->getVar('isi'),
        ];
        $model->insert($data);

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '23'
---
    public function show($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->find($id);

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '21'
UPDATE `artikel` SET `judul` = 'oii', `isi` = 'cokk'
WHERE `artikel`.`id` IN ('21')
---
    public function update($id = null)
    {
        $model = new ArtikelModel();

        $existingData = $model->find($id);
        if (!$existingData) {
            return $this->failNotFound('Data tidak ditemukan untuk diubah.');
        }
        parse_str($this->request->getBody(), $data);

        $updateData = array_filter($data, function($value) {
            return $value !== null && $value !== '';
        });

        if (empty($updateData)) {
            return $this->fail('Tidak ada data yang dikirim untuk diubah.', 400);
        }

        $model->update($id, $updateData);

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '26'
DELETE FROM `artikel`
WHERE `id` IN ('26')
---
    public function delete($id = null)
    {
        $model = new ArtikelModel();

        $data = $model->find($id);
        if ($data) {
            $model->delete($id);